app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password") VALUES (?, ?, ?, ?)  [["created_at", "2021-02-05 01:52:24.365516"], ["updated_at", "2021-02-05 01:52:24.365516"], ["username", "test"], ["password", "asdasdasd"]]
---
  def create
    @user = User.new(user_params)

    if @user.save